1) Pandas is an open source library built on top of Numpy
2) It allows for fast analysis and data cleaning and preparation
3) it excels in performance and productivity 
4) it also has built in visualtization features
5) It can work with data from wide variety of sources
6) install pandas using conda install pandas

# Series

In [4]:
import numpy as np
import pandas as pd

In [5]:
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [6]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [10]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [11]:
z=pd.Series(d)

In [12]:
max

In [13]:
pd.Series(data=[sum,print,len]) #can contain multiple data-types

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [14]:
ser1=pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [15]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [16]:
ser2=pd.Series([1,2,3,4],['USA','Germany','Italy','Japan'])

In [17]:
ser2

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [18]:
ser1['USA']

1

In [19]:
ser3=pd.Series(data=labels)

In [20]:
ser3

0    a
1    b
2    c
dtype: object

In [21]:
ser3[1]

'b'

In [22]:
ser1+ser2 #if we do any operation on series resultant data will be of type float

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [23]:
s=pd.Series([1,2,3,4])

In [24]:
s

0    1
1    2
2    3
3    4
dtype: int64

In [25]:
s['Animal']='Bears'

In [26]:
s

0             1
1             2
2             3
3             4
Animal    Bears
dtype: object

In [27]:
s.loc['Wild']='tiger'

In [28]:
s

0             1
1             2
2             3
3             4
Animal    Bears
Wild      tiger
dtype: object

In [29]:
s.drop('Wild')

0             1
1             2
2             3
3             4
Animal    Bears
dtype: object

In [30]:
original_sports=pd.Series({'Archery':'Bhutan','Golf':'Scotland','Sumo':'Japan','Taekwondo':'South Korea'},name='Sport')

In [31]:
Cricket_loving_Countries=pd.Series(['Australia','Barbados','Pakistan','England'],index=['Cricket','Cricket','Cricket','Cricket'],name='country')

In [32]:
original_sports

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
Name: Sport, dtype: object

In [33]:
Cricket_loving_Countries

Cricket    Australia
Cricket     Barbados
Cricket     Pakistan
Cricket      England
Name: country, dtype: object

In [34]:
all_countries=original_sports.append(Cricket_loving_Countries)

In [35]:
all_countries

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
Cricket        Australia
Cricket         Barbados
Cricket         Pakistan
Cricket          England
dtype: object

# Pandas Dataframe

In [36]:
from numpy.random import randn

In [37]:
np.random.seed(101)

In [38]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

# each column is a series sharing a common index and name as column name

In [39]:
df['W'] # will grab 'W' column, will look like a series

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [40]:
type(df['W'])

pandas.core.series.Series

In [41]:
type(df)

pandas.core.frame.DataFrame

In [42]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [43]:
df['new']=df['W']+df['Z']

In [44]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [45]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [46]:
df #still new column is not permanently removed

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [47]:
df.drop('new',axis=1,inplace=True)

In [48]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [50]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [51]:
df.drop('E',axis=0,inplace=True)

In [52]:
df.shape #will give tuple of dimensions

(4, 4)

In [53]:
df['X'] #to get 'X'column

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
Name: X, dtype: float64

In [54]:
df.loc['A'] #to get 'A'row

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [55]:
df.iloc[0] #to get the 0 row i.e A row

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [56]:
df.loc['A','X']

0.6281327087844596

In [57]:
df.loc[['A','B'],['Y','Z']] #give subset of data frame

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

In [59]:
df.loc[['A','B']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965